; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	infrared3 - mode
	thermograph2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	Star6 - direction
	Star5 - direction
	Star4 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument6 spectrograph0)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
)
(:goal (and
	(pointing satellite3 Planet7)
	(pointing satellite4 Star4)
	(have_image Planet7 spectrograph1)
	(have_image Star8 spectrograph0)
	(have_image Planet9 thermograph2)
	(have_image Star10 infrared3)
	(have_image Phenomenon11 thermograph2)
	(have_image Planet12 spectrograph0)
	(have_image Star13 thermograph2)
	(have_image Star14 spectrograph1)
	(have_image Planet15 infrared3)
))

)

; plan
1. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 1 of 11
2. (calibrate satellite3 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 1 of 11
3. (turn_to satellite3 star13 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star13)
   goals met: 1 of 11
4. (take_image satellite3 star13 instrument4 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 2 of 11
5. (turn_to satellite3 planet9 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 planet9)
   goals met: 2 of 11
6. (take_image satellite3 planet9 instrument4 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 3 of 11
7. (turn_to satellite3 planet12 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet12)
   goals met: 3 of 11
8. (take_image satellite3 planet12 instrument4 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 4 of 11
9. (turn_to satellite3 phenomenon11 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon11)
   goals met: 4 of 11
10. (turn_to satellite1 star4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star4)
   goals met: 4 of 11
11. (take_image satellite3 phenomenon11 instrument4 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 5 of 11
12. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 5 of 11
13. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 5 of 11
14. (turn_to satellite1 planet15 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet15)
   goals met: 5 of 11
15. (take_image satellite1 planet15 instrument1 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 6 of 11
16. (turn_to satellite1 star10 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star10)
   goals met: 6 of 11
17. (take_image satellite1 star10 instrument1 infrared3)
   added: (have_image star10 infrared3)
   goals met: 7 of 11
18. (turn_to satellite1 star14 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star14)
   goals met: 7 of 11
19. (take_image satellite1 star14 instrument1 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 8 of 11
20. (turn_to satellite3 star8 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star8)
   goals met: 8 of 11
21. (take_image satellite3 star8 instrument4 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 9 of 11
22. (turn_to satellite3 planet7 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 planet7)
   goals met: 10 of 11
23. (take_image satellite3 planet7 instrument4 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 11 of 11
